[  { 
      "name": "This Very Website",
      "date": "Mar 16, 2022",
      "desc": "Inception",
      "images": [

      ],
      "chips": ["VsCode","JavaScript","React","NextJS","SASS","HTML","CSS","MUI","Git"],
      "text": "With a tasteful blend of Next.js, Sass, and MUI, this site is the lovechild of everything I'm interested in at the moment. Additionally, these things are what I've been told by industry professionals is the most sought-after set of skills.\n"
   },
   {
      "name": "BlackJack",
      "date": "Mar 9, 2022",
      "desc": "Silly little browser game",
      "images": [
         "/images/blackjack/0.jpg",
         "/images/blackjack/1.jpg",
         "/images/blackjack/2.jpg"
      ],
      "link": "https://github.com/liamdoka/blackJack",
      "chips": ["VsCode","JavaScript","React","NextJS","SASS","HTML","CSS"],
      "text": "I initally created this simulated casino game with the intention of learning how to count cards. \nBut it seems that it has proven more fun to code using React and Next.js than it is to mindlessly count... \nWho would have thought?"
   },
   { 
      "name": "UltimateWerewolf",
      "date": "Feb 10, 2022",
      "desc": "Silly little multiplayer browser game",
      "images": [
         "/images/ultimateWerewolf/0.jpg",
         "/images/ultimateWerewolf/1.jpg",
         "/images/ultimateWerewolf/2.jpg"
      ],
      "link": "https://github.com/liamdoka/ultimateWerewolf",
      "chips": ["VsCode","JavaScript","NodeJS","SocketIO","Express","MDL","SASS","CSS","HTML"],
      "text": "Played a game of this in-person only a day before my friend moved away for a year. \nI committed to learning WebSocket and finally making a game where we could all play and stick together. As it turns out, WebSocket is really confusing.\nBut I had a lot of fun and learnt a lot about SASS by making this.\nI don't think I can ever go back to plain CSS again... "
   },
   { 
      "name": "Server Utilization Report Tool",
      "date": "Jan 15, 2022",
      "desc": "Linux Server Utilization Monitoring and Alert Generation System",
      "images": [
          
      ],        
      "chips": ["VsCode","Linux","VIM","Python","Pandas","HTML","Slack"],
      "text": "My first expedition into professional software development saw me creating a python application that would measure the server usages, and generate a report of said statistics.\nThat report would then be turned into a PDF and sent via email and Slack channel.\nThis Project showed me that almost everything in a professional software package needs to be configurable, in case they change their mind later... which they are quite prone to doing."
   },
   { 
      "name": "Spotify Genre Analyzer",
      "date": "Jun 10, 2021",
      "desc": "Login with Spotify to discover your favourite genres",
      "images": [
          
      ],
      "link": "https://github.com/liamdoka/spotifyApp",
      "chips": ["Python","HTML","JavaScript","CSS","Flask","VsCode","SpotifyAPI"],
      "text": "This Project was my first ever use of a Python WebServer - Flask. Additionally it was mostly to get used to data manipulation with the help of the Official Spotify API. Definitely not as flashy on the visual end of things, but I'm proud of how it turned out otherwise"
   },
   { 
      "name": "Song Writing Bot",
      "date": "Oct 12, 2021",
      "desc": "WebScraper, Poet, Musician.",
      "images": [
          
      ],
      "link": "https://github.com/liamdoka/lyricWriter",
      "chips": ["VsCode","Python","Selenium","HTML","Notion"],
      "text": "This python application uses Selenium and ChromeDriver to scrape facebook posts from notable page 'UniMelb Love Letters'. The application then splits the posts up into song lyrics using the Natural Language Toolkit - analyzing the syllables, rhymes, and semantic contents of the lines."
   },
   { 
      "name": "Shower Playlist Generator",
      "date": "Aug 8, 2021",
      "desc": "When you need a playlist ASAP",
      "images": [
          
      ],
      "chips": ["VsCode","Python","SpotifyAPI"],
      "text": "Every time I went to have a shower, I wanted a new experience.\nUsing an intial playlist as a pool, this generator gets the list of tracks in the pool and adds a random set to the Shower Playlist - equating to the specified time for the shower."
   },
   { 
      "name": "Uni Subject Review Hub",
      "date": "Sep 10, 2021",
      "desc": "Review your subjects (honestly for once)",
      "images": [
         
         ],
      "link": "",
      "chips": ["VsCode","NodeJS","Express","MongoDB","MDL","HTML","CSS","JavaScript","Git"],
      "text": "An integrated web application  where students of my university could review their subjects on a variety of different metrics, and then be recommended other subjects based on the their preferences - and what students with similar preferences have enjoyed."
   },
   { 
      "name": "Custom Calendar App",
      "date": "Sep 9, 2018",
      "desc": "Plan your life, week by week",
      "images": [
              
      ],
      "link": "https://github.com/liamdoka/phpCalendar",
      "chips": ["PHP","Apache","XAMPP","HTML","CSS","JavaScript","Git","SEO"],
      "text": "My first ever serious programming endeavor at the ripe old age of 16.\n We were forced to use PHP, but I grew quite fond of it eventually - despite all of its shortcomings."
   }

]